src/convergence_10/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    inlet
    {
        type            patch;
        nFaces          5;
        startFace       85;
    }
    sym
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          3;
        startFace       90;
    }
    wedge
    {
        type            patch;
        nFaces          7;
        startFace       93;
    }
    top
    {
        type            patch;
        nFaces          10;
        startFace       100;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          50;
        startFace       110;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          50;
        startFace       160;
    }
    outlet
    {
        type            patch;
        nFaces          5;
        startFace       210;
    }
)

// ************************************************************************* //
